In [4]:
import pandas as pd
import numpy as np

In [5]:
suppliers = pd.read_csv('../data/northwind-mongo-master/suppliers.csv',
                       usecols=['SupplierID', 'CompanyName', 'City'])

In [6]:
suppliers.head(2)

   SupplierID                 CompanyName         City
0           1              Exotic Liquids       London
1           2  New Orleans Cajun Delights  New Orleans

In [7]:
products = pd.read_csv('../data/northwind-mongo-master/products.csv',
                      usecols=['ProductID', 'ProductName', 'SupplierID', 'CategoryID'])

In [8]:
products.head(2)

   ProductID ProductName  SupplierID  CategoryID
0          1        Chai           1           1
1          2       Chang           1           1

In [9]:
categories = pd.read_csv('../data/northwind-mongo-master/categories1.csv',
                        usecols=['CategoryID', 'CategoryName'],
                        index_col='CategoryID')

In [10]:
categories.head(2)

           CategoryName
CategoryID
1             Beverages
2            Condiments

In [11]:
prod_cat = products.merge(categories, on='CategoryID')

In [13]:
prod_cat.head(3)

   ProductID         ProductName  SupplierID  CategoryID CategoryName
0          1                Chai           1           1    Beverages
1          2               Chang           1           1    Beverages
2         24  Guaran치 Fant치stica          10           1    Beverages

In [14]:
prod_cat_2 = products.merge(categories, left_on='CategoryID', right_index=True)

In [15]:
prod_cat_2.head(3)

    ProductID         ProductName  SupplierID  CategoryID CategoryName
0           1                Chai           1           1    Beverages
1           2               Chang           1           1    Beverages
23         24  Guaran치 Fant치stica          10           1    Beverages

In [16]:
prod_cat_supp = prod_cat_2.merge(suppliers, on='SupplierID', indicator=True)

In [17]:
prod_cat_supp.head()

,ProductID,ProductName,SupplierID,CategoryID,CategoryName,CompanyName,City,_merge
0,1,Chai,1,1,Beverages,Exotic Liquids,London,both
1,2,Chang,1,1,Beverages,Exotic Liquids,London,both
2,3,Aniseed Syrup,1,2,Condiments,Exotic Liquids,London,both
3,24,Guaran치 Fant치stica,10,1,Beverages,Refrescos Americanas LTDA,Sao Paulo,both
4,34,Sasquatch Ale,16,1,Beverages,Bigfoot Breweries,Bend,both

In [18]:
products.merge(categories, left_on='CategoryID', right_index=True).merge(suppliers, on='SupplierID', indicator=True).head()

,ProductID,ProductName,SupplierID,CategoryID,CategoryName,CompanyName,City,_merge
0,1,Chai,1,1,Beverages,Exotic Liquids,London,both
1,2,Chang,1,1,Beverages,Exotic Liquids,London,both
2,3,Aniseed Syrup,1,2,Condiments,Exotic Liquids,London,both
3,24,Guaran치 Fant치stica,10,1,Beverages,Refrescos Americanas LTDA,Sao Paulo,both
4,34,Sasquatch Ale,16,1,Beverages,Bigfoot Breweries,Bend,both